lvx/base/DataProcessors/ПанельАдминистрированияУчетПрослеживаемыхТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПанельАдминистрированияУчетПрослеживаемыхТоваров</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

lvx/base/Catalogs/ВидыЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыЗапасов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗапасов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецТовара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияЗапасовДругойОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗапасовВладельца</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПередачиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоПредназначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПредназначенияВидовЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоСделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СделкиСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансовогоУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстарелоНазначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦенПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДубль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Устаревший</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/DataProcessors/ПанельАдминистрированияУчетПрослеживаемыхТоваров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует таблицу документов к оформлению по остаткам прослеживаемых товаров на комиссии, в номерах ГТД по которым не установлен признак РНПТ.
// Такие товары необходимо "виртуально" вернуть комитенту, а затем снова принять на комиссию с указанием РНПТ.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - таблица документов к оформлению по остаткам прослеживаемых товаров на комиссии
//
Функция ПолучитьДокументыКОформлениюПоПрослеживаемымТоварамНаКомиссии() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаДокументовКОформлениюПоТоварамНаКомиссии();
	Запрос.УстановитьПараметр("ДатаНачалаПрослеживаемости", УчетПрослеживаемыхТоваровЛокализация.ДатаНачалаУчетаПрослеживаемыхИмпортныхТоваров());
	ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции

// Формирует текст запроса таблицы возвратов товаров от комиссионера.
// 
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция СформироватьТекстЗапросаТаблицаВозвратыТоваровОтКомиссионеров() Экспорт
	
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.МестоХранения КАК Комиссионер,
		|	ТоварыПереданныеНаКомиссиюОстатки.Соглашение КАК Соглашение,
		|	ТоварыПереданныеНаКомиссиюОстатки.Организация КАК Организация
		|ПОМЕСТИТЬ ВТОстатки
		|ИЗ
		|	РегистрНакопления.ТоварыПереданныеНаКомиссию.Остатки КАК ТоварыПереданныеНаКомиссиюОстатки
		|ГДЕ
		|	ТоварыПереданныеНаКомиссиюОстатки.НомерГТД <> ЗНАЧЕНИЕ(Справочник.НомераГТД.ПустаяСсылка)
		|	И НЕ ЕСТЬNULL(ТоварыПереданныеНаКомиссиюОстатки.НомерГТД.ТипНомераГТД, ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.ПустаяСсылка)) В
		|			(ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТ),
		|			ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТКомплекта))
		|	И ЕСТЬNULL(ТоварыПереданныеНаКомиссиюОстатки.АналитикаУчетаНоменклатуры.Номенклатура.ПрослеживаемыйТовар, ЛОЖЬ)
		|	И ЕСТЬNULL(ТоварыПереданныеНаКомиссиюОстатки.Соглашение.КомиссионерВедетУчетПоРНПТ, ЛОЖЬ)
		|	И ТоварыПереданныеНаКомиссиюОстатки.КоличествоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтчетКомиссионера.Партнер КАК Партнер,
		|	ОтчетКомиссионера.Соглашение КАК Соглашение,
		|	ОтчетКомиссионера.Организация КАК Организация,
		|	МАКСИМУМ(ИСТИНА) КАК ОформленОтчет
		|ПОМЕСТИТЬ ОформленныеОтчеты
		|ИЗ
		|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
		|ГДЕ
		|	ОтчетКомиссионера.Проведен = ИСТИНА
		|	И ОтчетКомиссионера.Дата >= &ДатаПрослеживаемости
		|СГРУППИРОВАТЬ ПО
		|	ОтчетКомиссионера.Партнер,
		|	ОтчетКомиссионера.Соглашение,
		|	ОтчетКомиссионера.Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОстатки.Комиссионер КАК Комиссионер,
		|	ВТОстатки.Соглашение КАК Соглашение,
		|	ВТОстатки.Организация КАК Организация,
		|	ЕСТЬNULL(ОформленныеОтчеты.ОформленОтчет, ЛОЖЬ) КАК ОформленОтчет
		|ИЗ
		|	ВТОстатки КАК ВТОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ОформленныеОтчеты КАК ОформленныеОтчеты
		|		ПО ВТОстатки.Комиссионер = ОформленныеОтчеты.Партнер
		|		И ВТОстатки.Соглашение = ОформленныеОтчеты.Соглашение
		|		И ВТОстатки.Организация = ОформленныеОтчеты.Организация
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТОстатки.Соглашение,
		|	ВТОстатки.Организация,
		|	ВТОстатки.Комиссионер,
		|	ЕСТЬNULL(ОформленныеОтчеты.ОформленОтчет, ЛОЖЬ)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

// Формирует текст запроса таблицы к оформлению передач.
// 
// Возвращаемое значение:
//  Строка - текст запроса
//
Функция СформироватьТекстЗапросаТаблицаКОформлениюПередач() Экспорт
	
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВозвратТоваровОтКлиентаТовары.Ссылка КАК ДокументВозврат,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Организация КАК Организация,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Партнер КАК Партнер,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Соглашение КАК Соглашение,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Дата КАК ДатаВозврата,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Склад КАК Склад,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Номер КАК Номер
		|ПОМЕСТИТЬ ВТВозвраты
		|ИЗ
		|	Документ.ВозвратТоваровОтКлиента.Товары КАК ВозвратТоваровОтКлиентаТовары
		|ГДЕ
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Проведен
		|	И ЕСТЬNULL(ВозвратТоваровОтКлиентаТовары.Номенклатура.ПрослеживаемыйТовар, ЛОЖЬ)
		|	И ВозвратТоваровОтКлиентаТовары.Ссылка.Склад = &Склад
		|
		|СГРУППИРОВАТЬ ПО
		|	ВозвратТоваровОтКлиентаТовары.Ссылка,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Организация,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Партнер,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Соглашение,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Дата,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Склад,
		|	ВозвратТоваровОтКлиентаТовары.Ссылка.Номер
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК ДокументПередача,
		|	РеализацияТоваровУслуг.Дата КАК ДатаПередачи,
		|	1 КАК КолВоПередач,
		|	РеализацияТоваровУслуг.Склад КАК Склад,
		|	РеализацияТоваровУслуг.Организация КАК Организация,
		|	РеализацияТоваровУслуг.Партнер КАК Партнер,
		|	РеализацияТоваровУслуг.ОснованиеНомер КАК ОснованиеНомер,
		|	РеализацияТоваровУслуг.ОснованиеДата КАК ОснованиеДата
		|ПОМЕСТИТЬ ВТПередачи
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.ХозяйственнаяОперация = &ХОПередачаНаКомиссию
		|	И РеализацияТоваровУслуг.Проведен
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТВозвраты.ДокументВозврат КАК Возврат,
		|	ВТВозвраты.Организация КАК Организация,
		|	ВТВозвраты.Партнер КАК Комиссионер,
		|	ВТВозвраты.Соглашение КАК Соглашение,
		|	СУММА(ЕСТЬNULL(ВТПередачи.КолВоПередач, 0)) КАК Передача
		|ИЗ
		|	ВТВозвраты КАК ВТВозвраты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПередачи КАК ВТПередачи
		|		ПО (НАЧАЛОПЕРИОДА(ВТВозвраты.ДатаВозврата, ДЕНЬ) = НАЧАЛОПЕРИОДА(ВТПередачи.ОснованиеДата, ДЕНЬ))
		|			И ВТВозвраты.Организация = ВТПередачи.Организация
		|			И ВТВозвраты.Склад = ВТПередачи.Склад
		|			И ВТВозвраты.Партнер = ВТПередачи.Партнер
		|			И ВТВозвраты.Номер = ВТПередачи.ОснованиеНомер
		|
		|	// УсловиеКОформлению
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТВозвраты.ДокументВозврат,
		|	ВТВозвраты.Партнер,
		|	ВТВозвраты.Организация,
		|	ВТВозвраты.Соглашение";
	
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДокументовКОформлениюПоТоварамНаКомиссии()
	
	Возврат
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЗапасов.Ссылка КАК ВидЗапасов
	|ПОМЕСТИТЬ ВидыЗапасовКомиссия
	|ИЗ
	|	Справочник.ВидыЗапасов КАК ВидыЗапасов
	|ГДЕ
	|	ВидыЗапасов.ТипЗапасов = ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.КомиссионныйТовар)
	|	И НЕ ВидыЗапасов.РеализацияЗапасовДругойОрганизации
	|	И ВидыЗапасов.ВладелецТовара ССЫЛКА Справочник.Партнеры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыОрганизаций.Организация КАК Организация,
	|	ТоварыОрганизаций.ВидЗапасов.ВладелецТовара КАК Комитент,
	|	ТоварыОрганизаций.ВидЗапасов.Соглашение КАК Соглашение,
	|	ВЫРАЗИТЬ(Аналитика.МестоХранения КАК Справочник.Склады) КАК Склад,
	|	ЗНАЧЕНИЕ(Документ.ВозвратТоваровПоставщику.ПустаяСсылка) КАК ДокументВозврата,
	|	ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка) КАК ДокументПриемаНаКомиссию,
	|	ИСТИНА КАК ЕстьОстаток,
	|	ЛОЖЬ КАК ЕстьПроведенныйВозврат,
	|	ЛОЖЬ КАК ЕстьПроведенныйПрием
	|ПОМЕСТИТЬ ОрганизацииИКомитентыСОстатками
	|ИЗ
	|	РегистрНакопления.ТоварыОрганизаций.Остатки(&ДатаНачалаПрослеживаемости, ВидЗапасов В
	|		(ВЫБРАТЬ
	|			ВидЗапасов
	|		ИЗ
	|			ВидыЗапасовКомиссия КАК ВидыЗапасовКомиссия)) КАК ТоварыОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаНоменклатуры КАК Аналитика
	|		ПО ТоварыОрганизаций.АналитикаУчетаНоменклатуры = Аналитика.Ссылка
	|ГДЕ
	|	ЕСТЬNULL(Аналитика.Номенклатура.ПрослеживаемыйТовар, ЛОЖЬ)
	|	И НЕ ЕСТЬNULL(ТоварыОрганизаций.НомерГТД.ТипНомераГТД, ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.ПустаяСсылка)) В
	|			(ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТ),
	|			ЗНАЧЕНИЕ(Перечисление.ТипыНомеровГТД.НомерРНПТКомплекта))
	|	И ТоварыОрганизаций.КоличествоОстаток > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВозвратТоваровПоставщику.Организация КАК Организация,
	|	ВозвратТоваровПоставщику.Партнер КАК Комитент,
	|	ВозвратТоваровПоставщику.Соглашение КАК Соглашение,
	|	ВозвратТоваровПоставщику.Склад КАК Склад,
	|	МАКСИМУМ(ВозвратТоваровПоставщику.Ссылка) КАК ДокументВозврата,
	|	ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка) КАК ДокументПриемаНаКомиссию,
	|	ЛОЖЬ КАК ЕстьОстаток,
	|	МАКСИМУМ(ВозвратТоваровПоставщику.Ссылка.Проведен) КАК ЕстьПроведенныйВозврат,
	|	ЛОЖЬ КАК ЕстьПроведенныйПрием
	|ИЗ
	|	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
	|ГДЕ
	|	НЕ ВозвратТоваровПоставщику.ПометкаУдаления
	|	И ВозвратТоваровПоставщику.КорректировкаОстатковРНПТ
	|СГРУППИРОВАТЬ ПО
	|	ВозвратТоваровПоставщику.Организация,
	|	ВозвратТоваровПоставщику.Партнер,
	|	ВозвратТоваровПоставщику.Соглашение,
	|	ВозвратТоваровПоставщику.Склад,
	|	ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Организация КАК Организация,
	|	ПриобретениеТоваровУслуг.Партнер КАК Комитент,
	|	ПриобретениеТоваровУслуг.Соглашение КАК Соглашение,
	|	ПриобретениеТоваровУслуг.Склад КАК Склад,
	|	ЗНАЧЕНИЕ(Документ.ВозвратТоваровПоставщику.ПустаяСсылка) КАК ДокументВозврата,
	|	МАКСИМУМ(ПриобретениеТоваровУслуг.Ссылка) КАК ДокументПриемаНаКомиссию,
	|	ЛОЖЬ КАК ЕстьОстаток,
	|	ЛОЖЬ КАК ЕстьПроведенныйВозврат,
	|	МАКСИМУМ(ПриобретениеТоваровУслуг.Ссылка.Проведен) КАК ЕстьПроведенныйПрием
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	НЕ ПриобретениеТоваровУслуг.ПометкаУдаления
	|	И ПриобретениеТоваровУслуг.КорректировкаОстатковРНПТ
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг.Организация,
	|	ПриобретениеТоваровУслуг.Партнер,
	|	ПриобретениеТоваровУслуг.Соглашение,
	|	ПриобретениеТоваровУслуг.Склад,
	|	ЗНАЧЕНИЕ(Документ.ВозвратТоваровПоставщику.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацииИКомитентыСОстатками.Организация КАК Организация,
	|	ОрганизацииИКомитентыСОстатками.Комитент КАК Комитент,
	|	ОрганизацииИКомитентыСОстатками.Соглашение КАК Соглашение,
	|	ОрганизацииИКомитентыСОстатками.Склад КАК Склад,
	|	МАКСИМУМ(ОрганизацииИКомитентыСОстатками.ДокументВозврата) КАК ДокументВозврата,
	|	МАКСИМУМ(ОрганизацииИКомитентыСОстатками.ДокументПриемаНаКомиссию) КАК ДокументПриемаНаКомиссию,
	|	МАКСИМУМ(ОрганизацииИКомитентыСОстатками.ЕстьОстаток) КАК ЕстьОстаток,
	|	МАКСИМУМ(ОрганизацииИКомитентыСОстатками.ЕстьПроведенныйВозврат) КАК ЕстьПроведенныйВозврат,
	|	МАКСИМУМ(ОрганизацииИКомитентыСОстатками.ЕстьПроведенныйПрием) КАК ЕстьПроведенныйПрием
	|ПОМЕСТИТЬ ПредварительнаяТаблицаДокументов
	|ИЗ
	|	ОрганизацииИКомитентыСОстатками КАК ОрганизацииИКомитентыСОстатками
	|СГРУППИРОВАТЬ ПО
	|	ОрганизацииИКомитентыСОстатками.Организация,
	|	ОрганизацииИКомитентыСОстатками.Комитент,
	|	ОрганизацииИКомитентыСОстатками.Соглашение,
	|	ОрганизацииИКомитентыСОстатками.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредварительнаяТаблицаДокументов.Организация КАК Организация,
	|	ПредварительнаяТаблицаДокументов.Комитент КАК Комитент,
	|	ПредварительнаяТаблицаДокументов.Соглашение КАК Соглашение,
	|	ПредварительнаяТаблицаДокументов.Склад КАК Склад,
	|	ПредварительнаяТаблицаДокументов.ДокументВозврата,
	|	ВЫБОР
	|		КОГДА ПредварительнаяТаблицаДокументов.ДокументВозврата = ЗНАЧЕНИЕ(Документ.ВозвратТоваровПоставщику.ПустаяСсылка)
	|			ТОГДА 3
	|		КОГДА ПредварительнаяТаблицаДокументов.ДокументВозврата.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ДокументВозвратаСостояние,
	|	ПредварительнаяТаблицаДокументов.ДокументПриемаНаКомиссию,
	|	ВЫБОР
	|		КОГДА
	|			ПредварительнаяТаблицаДокументов.ДокументПриемаНаКомиссию = ЗНАЧЕНИЕ(Документ.ПриобретениеТоваровУслуг.ПустаяСсылка)
	|			ТОГДА 3
	|		КОГДА ПредварительнаяТаблицаДокументов.ДокументПриемаНаКомиссию.Проведен
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ДокументПриемаСостояние
	|ИЗ
	|	ПредварительнаяТаблицаДокументов КАК ПредварительнаяТаблицаДокументов
	|ГДЕ
	|	ВЫБОР
	|		КОГДА ПредварительнаяТаблицаДокументов.ЕстьОстаток
	|			ТОГДА ИСТИНА
	|		КОГДА ПредварительнаяТаблицаДокументов.ЕстьПроведенныйВозврат
	|		И НЕ ПредварительнаяТаблицаДокументов.ЕстьПроведенныйПрием
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Комитент,
	|	Соглашение,
	|	Склад
	|АВТОУПОРЯДОЧИВАНИЕ";
	
КонецФункции

#КонецОбласти

#КонецЕсли
